In [20]:
#1.4 lesson stepik

In [3]:
import pandas as pd
import numpy as np

In [4]:
students_performance = pd.read_csv("StudentsPerformance.csv")

In [5]:
students_performance.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [6]:
students_performance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [7]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [8]:
students_performance.shape

(1000, 8)

In [9]:
students_performance.groupby('gender').aggregate({'writing score' : 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [10]:
students_performance.size

8000

In [11]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [12]:
students_performance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [14]:
students_performance.iloc[[1, 3, 10], [0, 4, -2]]

    gender test preparation course  reading score
1   female               completed             90
3     male                    none             57
10    male                    none             54

In [15]:
students_performance_with_names = students_performance.iloc[[0,3,4,6,9]]

In [17]:
students_performance_with_names.index = ["asdf", "asdgsb", "aghdsdf", "sdf a as", "asdfasdf"]

In [21]:
students_performance_with_names.loc[['asdf', 'sdf a as'], ['gender', 'math score']] #type = Dataframe

          gender  math score
asdf      female          72
sdf a as  female          88

In [27]:
students_performance_with_names.iloc[:, 0] #type = series

asdf        female
asdgsb        male
aghdsdf       male
sdf a as    female
asdfasdf    female
Name: gender, dtype: object

In [34]:
my_series1 = pd.Series([1,2,3], index = ["asdf", "asdgsb", "aghdsdf"])
my_series2 = pd.Series([4,5,6], index = ["asdf", "asdgsb", "aghdsdf"])

In [35]:
pd.DataFrame({'column1': my_series1, 'col2': my_series2})

         column1  col2
asdf           1     4
asdgsb         2     5
aghdsdf        3     6

In [40]:
print(students_performance_with_names['gender'])
students_performance_with_names[['gender']] #type=dataframe

asdf        female
asdgsb        male
aghdsdf       male
sdf a as    female
asdfasdf    female
Name: gender, dtype: object

          gender
asdf      female
asdgsb      male
aghdsdf     male
sdf a as  female
asdfasdf  female

In [42]:
quiz = pd.read_csv('titanic.csv')

In [43]:
quiz.shape

(891, 12)

In [44]:
quiz.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object